"""
Модуль предназначен для расчета установившегося режима
"""

# import Python lib
import logging

# import win32com
from win32com.client import CDispatch


logger = logging.getLogger("PyRastrWin")


def rgm(rastr_win: CDispatch, par: str = "p") -> bool:
    """
    Расчет установившегося режима.

    Args:
        rastr_win: Dispatch("Astra.Rastr")
        par: строка дополнительных параметров.
        Параметры могут быть следующими:
            ""  c параметрами по умолчанию;
            "p"  расчет с плоского старта;
            "z"  отключение стартового алгоритма;
            "c"  отключение контроля данных;
            "r"  отключение подготовки данных (можно использовать при повторном расчете режима с измененными
                  значениями узловых мощностей и модулей напряжения).
    Return:
        True: режим сбалансирован; False: режим не сбалансирован.
    """
    params = {
        "": ["", "c параметрами по умолчанию"],
        "p": ["p", "p - расчет с плоского старта"],
        "z": ["z", "z - отключение стартового алгоритма"],
        "c": ["c", "c -  отключение контроля данных"],
        "r": [
            "r",
            "r - отключение подготовки данных (можно использовать при повторном расчете режима с измененными "
            "значениями узловых мощностей и модулей напряжения)",
        ],
    }
    try:
        kod = rastr_win.rgm(params[par])
    except KeyError:
        par = ""
        kod = rastr_win.rgm(params[par])
    if kod == 0:
        logger.info(f"Режим сбалансирован: %s", params[par][1])
        return True
    else:
        logger.warning(f"Режим не сбалансирован: %s", params[par][1])
        return False
