{"[g_start]":0,"[g_end]":1,"[unknown]":2,"[pad]":3," ":4,"#":5,"+":6,"-":7,".":8,"0":9,"1":10,"2":11,"3":12,"4":13,"5":14,"6":15,"7":16,"8":17,"9":18,"=":19,"B":20,"K":21,"N":22,"O":23,"Q":24,"R":25,"[":26,"]":27,"_":28,"a":29,"b":30,"c":31,"d":32,"e":33,"f":34,"g":35,"h":36,"n":37,"r":38,"s":39,"t":40,"x":41," 1":42," 2":43," N":44," 3":45," R":46," B":47," Q":48,"1.":49,"4.":50,"5.":51,"xd":52,"6.":53,"7.":54,"+ ":55,"8.":56,"9.":57,"0.":58,"2.":59,"3.":60," 4":61,"xe":62,"f6":63,"xc":64,"f3":65," K":66,"g_":67,"-O":68,"O-O":69,"d4":70,"e4":71," c":72,"f4":73,"c3":74,"f5":75,"e5":76," d":77,"d7":78,"xb":79,"g5":80,"e6":81," 5":82,"e7":83,"e3":84,"c4":85,"e2":86,"g4":87,"d2":88,"g6":89,"xd4":90,"c6":91,"d3":92,"xd5":93,"g3":94," b":95," a":96," Nf6":97,"Nf3":98,"g7":99,"ar":100,"en":101,"st":102,"g_en":103,"g_st":104,"art":105,"g_end":106,"g_start":107," 2.":108," 3.":109," 4.":110," 5.":111," 8.":112," 7.":113," 9.":114," 6.":115," 10.":116," 11.":117,"d5":118," 12.":119," 13.":120," 14.":121," 15.":122," h":123," 16.":124," 17.":125," 18.":126," 19.":127,"b3":128,"xe5":129," 20.":130,"e8":131," 21.":132," O-O":133,"e1":134,"a4":135,"Nc3":136," 22.":137,"b4":138," 23.":139,"h4":140,"d1":141,"c7":142,"d6":143,"c5":144,"d8":145," 24.":146," 25.":147,"g2":148,"h3":149,"xe4":150," 26.":151,"c8":152,"f8":153," 27.":154,"Ra":155,"f7":156,"f2":157," 28.":158,"c2":159," Ra":160," 29.":161," Nc6":162,"b6":163," c5":164," 30.":165,"c1":166,"xa":167,"b5":168,"f1":169,"h5":170," 31.":171," d5":172," 32.":173," 33.":174,"xf6":175," e6":176," 6":177,"b7":178," 34.":179,"Kh":180," e5":181," 35.":182," g6":183,"xc4":184,"a3":185,"b8":186,"xc5":187,"xc3":188," d6":189," 36.":190,"b1":191," 37.":192,"a5":193,"h6":194,"xc6":195," Be7":196,"xf5":197,"Be3":198," 38.":199," a6":200," 39.":201," e":202,"Bd3":203,"xf3":204," Bg7":205," 40.":206,"b2":207,"xf4":208," b5":209,"g8":210," h6":211,"xb5":212," 41.":213," f5":214,"xe6":215,"xd6":216,"Be2":217," Qc7":218,"g1":219," 42.":220," c6":221,"Re1":222,"Bg5":223," a5":224," Re8":225," cxd4":226,"xg5":227," 43.":228,"xb4":229,"h7":230,"Qd2":231," b6":232," Nd7":233,"a6":234," Bd7":235," 44.":236,"Qe2":237,"Rf":238,"xg4":239,"Bg2":240," h5":241," 45.":242,"Nxd4":243," Rc8":244,"xd3":245," Rf":246," Bb7":247,"Rx":248," Be6":249," Nb":250,"xe3":251,"Qc2":252," 46.":253," f":254," g5":255,"h8":256," 47.":257,"Nd2":258," f6":259,"xe7":260,"xg6":261,"Rc1":262,"Kg2":263," Nbd7":264," Qe7":265,"Rd1":266,"Bd2":267,"Bf4":268,"Bc4":269,"Kf2":270," 48.":271,"xd7":272," Rd8":273," Rb8":274," Rx":275," g":276," 49.":277," 7":278,"xb3":279," Bd6":280," Qb6":281,"cxd5":282," Qd7":283," Bg4":284," 50.":285,"Ne5":286,"xb6":287,"xd2":288,"h2":289,"Bx":290,"Kh1":291,"Ne2":292,"xd8":293,"exd5":294,"+[":295," 51.":296,"Kx":297," Bf5":298,"Bb5":299,"Ke2":300," Ne7":301,"Rb1":302," Ne5":303," Bb4":304," Bx":305," Kg7":306," Ne4":307,"Nd5":308," 52.":309,"xe2":310,"Kf1":311,"Ne4":312," Nd5":313,"Nb":314,"Qd3":315,"Kh2":316," Kf7":317,"Qx":318," Qa5":319,"xd1":320," Nc5":321," 53.":322,"Ke3":323,"Qb3":324,"xb2":325,"xb7":326,"Bb2":327,"Qf3":328," Nb6":329," Bc5":330,"Kf3":331," Nxd5":332," exd5":333," b4":334," 54.":335,"Rad1":336," Ke7":337,"Nd4":338,"dxe5":339,"Bxf6":340," Bf6":341,"h1":342,"xa5":343,"Nbd2":344,"xg3":345," 55.":346,"xa6":347,"Bb3":348,"Qe3":349,"Kg1":350,"Nb3":351," Nd4":352,"a7":353," 56.":354,"Nxe4":355,"Bf3":356,"Rd2":357,"xc8":358,"Ng5":359," Rf8":360," Kf8":361,"Ne3":362," Qf6":363,"Nc4":364,"Kd2":365,"Kd3":366,"Rf1":367,"Ng3":368," Nxe5":369," Bc6":370,"Kg3":371,"O-O-O":372,"bxc3":373," dxe4":374," exd4":375," Qd8":376," dxe5":377," e4":378," 57.":379," Nxe4":380," Qd6":381,"xc2":382," a4":383," Bf8":384," Qx":385,"xc7":386,"xe8":387,"Nxe5":388," Kf6":389," Ng4":390," c4":391,"Nx":392," Ne6":393," Rd7":394," dxc4":395,"xc1":396," 58.":397," f4":398,"Rfd1":399,"cxd4":400,"Re2":401," Rad8":402," Bxc3":403,"dxc5":404," Rac8":405," Ng6":406,"Nd3":407,"a2":408,"Bc2":409,"Kg7":410," Bxf3":411," Rg8":412," Nh5":413,"Rac1":414," d4":415,"xa3":416," Nf5":417,"Rfe1":418,"Nb5":419,"xe1":420," Ke6":421," Kh8":422," Nxd4":423," 59.":424," Rc7":425,"Ng":426,"Nf4":427," Ra8":428," Nc4":429," h4":430," Ng":431,"Bf1":432,"xa2":433," cxd5":434," Re7":435,"Qg3":436,"xa7":437," Kx":438,"Kh8":439,"a8":440," Na5":441,"Bxc4":442,"Nxd5":443," Ba6":444," Rfd8":445,"Bg3":446," Ne8":447," 60.":448,"Qf2":449,"Qg4":450,"Re3":451," Nb4":452,"Rc2":453,"Kg8":454,"Rg1":455,"Bd4":456," Rfe8":457,"fxe5":458," Nx":459,"Bc3":460," Kd7":461,"Rd3":462," Kh7":463,"Nf5":464,"Kf8":465,"Rd":466," Rf7":467," Qc6":468,"Ra1":469,"Rh":470," g4":471," bxc6":472,"Qc3":473,"Bh4":474,"Rf2":475,"Bxc6":476," Na6":477," Qe6":478," Nf4":479," Nd6":480,"Nxc6":481,"Ke4":482,"Qa4":483," Kd6":484,"Kb1":485,"Nc5":486," Qe8":487,"Bxe4":488," Qc8":489," 61.":490," Bg6":491," Nc7":492,"Na4":493,"Rf3":494,"Be4":495,"Qxd4":496,"a1":497," Bxd5":498," Bc8":499,"Kc2":500,"Re":501,"Kf7":502,"Qd4":503,"Kf4":504," 8":505,"Qd1":506," axb5":507,"Rc7":508," Nf8":509,"Kh7":510,"Qf4":511,"exf5":512," Bxe5":513,"Qe1":514,"Ke7":515,"Bxd4":516," Qc5":517,"Qh5":518,"Rd7":519," Qxd5":520," O-O-O":521," Nxc3":522," 62.":523,"Kd4":524," Nf":525," Bd4":526," Kg6":527,"Qe4":528,"Bxd5":529,"Bf2":530," Be5":531," Qg5":532," Bd5":533,"Nh4":534,"Kc3":535,"Rxd8":536," Kg8":537," exf4":538,"gx":539," fxe4":540," Qb7":541," Re":542,"Nxf6":543,"Nf1":544," Rd":545,"xa8":546,"axb5":547," Rc2":548,"Nd6":549," 63.":550,"Kf6":551," Bb6":552," Qf7":553,"axb4":554,"Qh4":555,"Bd5":556,"Bh6":557,"exf6":558," Rh":559,"Ke1":560," Re6":561,"Rae1":562,"Ra7":563," Qe5":564," Qd5":565," Qg6":566," Rd2":567," Qh4":568,"Nge2":569,"Nc2":570,"Bc1":571," Bxd4":572,"Bxe5":573," gx":574," gxf5":575,"Ne1":576," Qf5":577," Bh6":578,"Ba4":579," Bxe4":580," 64.":581,"Nd":582," fxe6":583,"Rc3":584," Rh8":585," Ra7":586,"Rc":587," Rf6":588," Rc":589," axb4":590,"Qc1":591," Bxc5":592,"Rb7":593,"Ba3":594,"Na3":595," Rd6":596,"Bxe7":597,"Qc4":598," Ra2":599," Bxf6":600,"Bxg7":601," Bg5":602,"Kg4":603,"Kg6":604,"Rg3":605,"Rd6":606,"Re7":607,"xa1":608,"Kh3":609," Rc6":610," Rb2":611,"Rd4":612," Nd3":613," 65.":614," Rae8":615,"Be5":616," Be8":617," Qb8":618,"Rh1":619," Be4":620," Rfc8":621," Kc7":622," Bb5":623,"exd4":624,"Qxd3":625,"Ke6":626," Rc4":627,"Nc6":628," Nge7":629," Ke5":630," Bd8":631," hxg5":632," Rb7":633,"hxg4":634," Rb":635,"Ke5":636,"Qg5":637," Bh5":638," Qh5":639,"Rd8":640,"Qxe4":641," gxf6":642,"Bh3":643,"hxg5":644,"Ng4":645,"Kf5":646,"Qxd5":647,"Rb3":648,"Rxe8":649,"Kd7":650,"Kc4":651," Qb4":652,"Rb":653,"Rxd5":654,"Bxf4":655," 66.":656,"36.":657," Bc7":658," Rxd1":659,"35.":660,"37.":661,"Bxc5":662,"34.":663,"38.":664," Rc5":665,"39.":666," Qd4":667,"Rab1":668,"Bc5":669,"33.":670,"Nxe6":671," Rd5":672,"40.":673," Ra1":674," Ra3":675,"Ra8":676," Re2":677,"Qxf3":678,"32.":679,"Ra2":680,"Kd1":681,"gxf3":682,"Rc6":683," bxc4":684," Kf5":685,"Ra3":686,"Qd5":687," Kc6":688,"Qe5":689,"31.":690," Rb6":691,"Bxe6":692,"Kd6":693," Bxf5":694,"gxf4":695," Rab8":696," Nfd7":697," Kxg7":698,"cxb5":699," Qxd4":700," Qxe5":701,"Re4":702,"Rh3":703,"Nd1":704,"Kg5":705,"xb8":706,"Qb2":707,"41.":708,"Ra6":709," Rd4":710,"Bxd6":711,"Rxd4":712,"Kd5":713," Bxd3":714,"gxf5":715,"30.":716," hxg4":717," Qxd6":718,"Rc8":719," Rb4":720," 67.":721," Rd3":722,"Bxf3":723," hxg6":724," Rd1":725," bxc5":726," Rc3":727," Bc4":728," Qe4":729,"Rd5":730,"axb3":731,"Rc5":732,"Rxe5":733,"Rb6":734,"Qh3":735,"Rxd6":736," Nh6":737,"Rfc1":738," Rc1":739,"Nc":740,"Bd1":741,"29.":742,"Bg4":743," Kd5":744,"Rb2":745,"Nf2":746,"Rxf7":747,"Nf6":748,"Rxc8":749," Ke8":750,"Rc4":751," Re5":752,"Ne6":753,"Bxf5":754,"#[":755,"Kb2":756," Ra6":757,"28.":758,"Re5":759,"Ke8":760,"Rb8":761,"42.":762," Qf4":763," Nf7":764," Rg6":765," d3":766," Nb8":767,"xa4":768,"fxe4":769," fxe5":770," Bxg2":771,"Bd6":772,"Re8":773,"Qxc4":774,"bxc4":775," 68.":776,"xb1":777," Re4":778," e3":779," a3":780," Nxc5":781," Bf7":782," Rb3":783," exf5":784," Ra4":785,"27.":786,"Rxe4":787,"Kh6":788," Ng5":789,"Rf4":790,"hxg6":791," Rb1":792,"Rxd1":793," Nxf3":794,"bxc5":795,"Rxe6":796," Nxe3":797," Qxe7":798,"Bb4":799,"43.":800," Qb5":801,"Kxg2":802," Rf5":803," Qg4":804,"Be1":805,"Bxd7":806,"Qxf6":807,"Kc5":808,"Kb3":809,"exd6":810,"Rb5":811,"Rxb7":812,"Qb4":813," Re1":814," Rxb2":815,"26.":816,"Rf7":817,"Ra5":818,"Bd7":819," Bxe3":820," Qc4":821,"Qf5":822,"fxe3":823,"hxg3":824,"Qxe5":825," Rxd4":826,"Nxc5":827,"44.":828,"Nh3":829," Qa6":830," dxc5":831," 69.":832,"Nxd7":833," Nd":834," Qxc5":835,"Bb1":836," Rxd5":837," Nxd3":838,"Nxc4":839," Rg7":840,"Ra4":841," Bxc4":842,"Kc6":843," Nc":844,"Qxd8":845,"25.":846," Ra5":847," Ne3":848,"Kc7":849,"Nxd6":850,"45.":851,"Kc1":852," Bxc6":853," Nd8":854," Rxc3":855,"Qh6":856,"Qb5":857," Rxe5":858," Nxc4":859," b3":860," Rxc4":861," Qxf6":862,"Bf5":863," Rxe1":864," Rxe4":865,"Rxd7":866," c3":867,"Rg2":868,"Re6":869," Rxc1":870,"Rb4":871," Qf8":872,"46.":873,"Qxc3":874,"Nf":875,"24.":876,"Nxf5":877," Rxa2":878," Nc3":879,"dxe6":880," gxf4":881,"Qc5":882," Bd3":883," 70.":884,"Kd8":885," f3":886,"Rxe7":887,"Qd6":888," Bf4":889,"Qf6":890," Nxf6":891,"Qa3":892,"dxe4":893,"Qg2":894," Rb5":895," Qg7":896,"Rxc6":897,"47.":898,"Rxf6":899," Qxb2":900," Bxe2":901,"Qb1":902,"dxc6":903,"Rxa7":904,"Qxd6":905," Nh7":906,"23.":907,"Bc6":908,"Rxf8":909," Nc8":910," Rf4":911,"Qe6":912,"Be6":913,"Qe7":914,"Nc1":915,"Bxb7":916," axb6":917," Bh3":918,"Rg7":919," Kg5":920," Kb8":921,"Rxc5":922,"Nh2":923,"48.":924,"Qxe6":925,"Rh7":926,"Qd7":927," Nxf4":928," Bxf4":929," Kc5":930,"Qxe3":931," Qa7":932,"Qc7":933," Re3":934," Bxb2":935," Qxe4":936,"Rh8":937,"22.":938," 71.":939," h3":940," Qh6":941,"Bxb5":942,"Nxb5":943," Rxc2":944," Ngf6":945," Rh6":946," Qe3":947," Rf2":948,"Bb6":949,"Rf8":950," Bxg5":951,"Bxg5":952,"49.":953," Bc3":954,"Rh4":955,"Rf6":956," Ne":957," Kd8":958," Ng7":959,"gxf6":960," 9":961,"Nb6":962," cxb4":963," Bxd2":964," Rxd8":965,"21.":966,"Kb4":967,"Qxb7":968," Rh1":969,"Rxf5":970,"fxg5":971," Nb5":972," Qa4":973,"fxg6":974,"Qxe2":975,"Nb4":976,"Nxe7":977,"bxc6":978,"Qxe7":979,"50.":980,"Kh4":981," Qxc3":982,"Bxa6":983,"Rg4":984," Nf3":985,"Rhe1":986,"Rxc7":987," Rh2":988,"Qf1":989,"Rf5":990," Rxf2":991," Qd3":992,"Qc6":993," 72.":994,"Qxf5":995,"Qxd7":996,"Qxd2":997," Qc2":998,"Bxc3":999,"Rxa6":1000,"Rxc4":1001," Ng8":1002,"Nb1":1003," Qd2":1004,"Kb6":1005," Rxe3":1006,"Bxf7":1007," bxc3":1008,"Nh5":1009,"20.":1010,"Rg8":1011,"Rxd3":1012,"51.":1013," Bxb5":1014," Rxf4":1015,"Bxg6":1016,"Rxc1":1017,"Nxg6":1018,"Qxc5":1019," Rg4":1020," fxg4":1021," Nxb3":1022,"Nd7":1023," fxg6":1024,"Ne":1025," Be3":1026,"Rxf4":1027,"Kb5":1028,"Rg5":1029," Rxc5":1030," Rh5":1031,"Qxc6":1032,"R1":1033," Rxd6":1034,"Rh2":1035," Qc3":1036,"Nc7":1037," Rxd2":1038," Ba5":1039," Rxf3":1040,"Nxg5":1041," Na4":1042," Rxd3":1043," Bxg4":1044,"Ne7":1045,"Rxc3":1046,"Qxf7":1047,"Na5":1048," Qxc4":1049," Rf1":1050," Rg5":1051," Rh7":1052,"52.":1053,"Bf6":1054,"Qxf4":1055," Qe2":1056,"19.":1057,"Rxd2":1058," 73.":1059,"Rh6":1060," Rg2":1061,"Bxh6":1062," Qxc6":1063," bxa4":1064," Rf3":1065," Bh4":1066," Kb7":1067," Nxd2":1068,"Qg6":1069,"Qd8":1070,"Qf7":1071,"Rxg7":1072," Ke4":1073," Qxf4":1074," Rg1":1075," dxc3":1076," Kh6":1077," Qxa2":1078,"Nxf7":1079,"Be7":1080," gxh5":1081,"Rxe1":1082," Bxe6":1083,"53.":1084," Rxf5":1085,"Rxe3":1086,"Ba2":1087," Rh4":1088,"Nxf4":1089," exf3":1090," g3":1091," Rxe2":1092," Bxd6":1093," Kd4":1094,"Qa5":1095," Rxf1":1096," Kf4":1097," Nxg3":1098,"Rxa5":1099,"18.":1100,"Kh5":1101," Kb6":1102," Rh3":1103,"Red1":1104," Ba4":1105,"Rh5":1106,"Ngf3":1107,"fxe6":1108,"Rg6":1109," Qxd7":1110," Qxf3":1111," Qxd2":1112," Rxc8":1113," Rxb3":1114,"cxb4":1115," Qa3":1116,"Qxh6":1117,"gxh5":1118," 74.":1119," cxb5":1120,"Qxg6":1121,"Qe8":1122," Nxg4":1123,"Bxf8":1124," Qh3":1125,"Nxc3":1126," Qe1":1127,"54.":1128," Qa8":1129,"Qb7":1130,"Rxh7":1131," Rxa4":1132," Qd1":1133," Qxd1":1134,"Qxg4":1135,"Rxf3":1136," Nh4":1137," Qf3":1138," Qb2":1139,"Qxg5":1140," Qc1":1141," cxd6":1142,"17.":1143,"Kb8":1144,"Rxb6":1145," Rxg2":1146,"Qb6":1147," Bxb4":1148,"Kxf2":1149," Rxc6":1150,"Bc7":1151,"Qc8":1152," Qxg5":1153,"axb6":1154,"Qxb6":1155,"Bh5":1156," Nb7":1157," Nb3":1158,"fxg4":1159,"Rxg6":1160,"Nxf3":1161,"55.":1162," Rxe6":1163,"Kb7":1164," axb3":1165,"Qxa7":1166," Rxd7":1167," Rg3":1168," Qxe6":1169," Rxa3":1170,"Bxg4":1171," R8":1172,"16.":1173,"Bxb6":1174," Qxe3":1175,"Kc8":1176," Rxb4":1177,"Rxb5":1178," 75.":1179,"bxa5":1180," Rxf6":1181,"cxd6":1182," Ne2":1183," Nxf5":1184,"Ba5":1185,"Ng2":1186,"Qa2":1187,"Qxb5":1188,"cxd3":1189," Red8":1190,"56.":1191," Nxb4":1192,"15.":1193," hxg3":1194,"Bxb4":1195,"Qxg7":1196," Bxf2":1197," Bb3":1198,"Rde1":1199," Qxb3":1200," fxg3":1201,"Rxe2":1202,"Kxf7":1203,"Rxb4":1204," Bf3":1205," Bxh3":1206," Qb1":1207," Kc4":1208,"14.":1209," Nc2":1210," Qf2":1211," Qa1":1212,"Ba6":1213," Qxb4":1214,"Qxb4":1215,"Qb8":1216," Qxf2":1217," gxh4":1218,"Ng6":1219,"Nxb6":1220," Bc2":1221,"Rcd1":1222,"Rg":1223,"Rxa4":1224," Qxf5":1225,"57.":1226,"12.":1227,"Ng1":1228," Qg3":1229," fxg5":1230," Kc8":1231," Kg4":1232,"13.":1233," 76.":1234," Bxg3":1235," Nd2":1236," Rxe7":1237,"Ka2":1238," Rxh2":1239," Bxb3":1240," Qb3":1241,"Qxa6":1242," Nxe2":1243,"Qxh5":1244,"Rxh6":1245,"Rxh5":1246,"Rxa8":1247,"Nf7":1248,"Kxf1":1249,"fxg3":1250,"Qa6":1251," Nxc6":1252,"Bxd3":1253," Rg":1254,"11.":1255,"Bg6":1256," Rxb5":1257," dxc6":1258," Bxf1":1259,"Nb2":1260," Qxc2":1261,"58.":1262," Rxg3":1263,"exf4":1264," Rfb8":1265," Ba7":1266," Ba3":1267,"Bh2":1268,"Qh8":1269," Rxa5":1270," Qxd3":1271,"gxh4":1272," Rcd8":1273,"Qh7":1274," Qxe2":1275,"Qxc7":1276," 77.":1277,"Ndb5":1278," Qxb5":1279," a2":1280,"10.":1281," Ng3":1282,"bxa4":1283," Rhe8":1284,"Bxd8":1285," d2":1286," Qxg3":1287,"Qa8":1288," Be2":1289," Rxc7":1290," Bb8":1291,"Qg7":1292,"59.":1293," Bd2":1294,"Qf8":1295," Bh7":1296," Kb5":1297," Rxh4":1298,"Ka1":1299,"Rxc2":1300,"Rxf2":1301,"Bxh7":1302,"Qa7":1303,"Rxf1":1304," c2":1305," Nxd7":1306," Qxg4":1307," cxb3":1308,"Qxh7":1309,"Nce2":1310,"Rxg5":1311," bxa5":1312," Rxb7":1313," Nxf2":1314," Qxh4":1315,"dxc4":1316," Rxh3":1317," Bxa3":1318,"Raf1":1319," Ba8":1320," Raf8":1321," Ndf6":1322,"Rhd1":1323," Rxa1":1324," 78.":1325,"Na2":1326," Bxa4":1327,"Nxb7":1328," Qxb6":1329,"60.":1330,"Bxc8":1331,"Bf7":1332,"cxb6":1333,"Qxa5":1334," b2":1335,"Kxd2":1336,"Qa1":1337," Qxa4":1338,"Qxe8":1339," Rde8":1340," Rxa8":1341,"Nxd2":1342,"Bb7":1343,"Rfb1":1344," Nxg5":1345,"Kxf3":1346," Qh1":1347,"Bf8":1348,"Rxa1":1349,"Kxg7":1350," Bb2":1351,"Bxd2":1352,"Bxe3":1353,"Rxb2":1354," Nxb2":1355," Rxg4":1356,"Nxc8":1357," Qxh3":1358," Na7":1359," Nxd6":1360," e2":1361,"Bxa7":1362," Nf2":1363," Bxh4":1364," Qxa3":1365," 79.":1366,"Rxb8":1367," Qa2":1368," Nbc6":1369," Qxb7":1370," Rxe8":1371," Qf1":1372," Rxa6":1373," Bg3":1374,"Ka3":1375,"61.":1376," Kxf7":1377,"Nxc7":1378,"Nxg4":1379," Nxe6":1380,"Nxb4":1381," Bf2":1382," Rxb6":1383," Nxa4":1384,"Kxe2":1385,"Qh2":1386," Bxc2":1387,"Nxg7":1388," Kf3":1389," Kb4":1390," Bxd7":1391,"Ndf3":1392,"N1":1393,"Qg8":1394,"Bxh5":1395,"Bg1":1396," Nxb5":1397,"Bxc7":1398,"Nh6":1399," 10":1400,"Nxa5":1401," Qxg2":1402," Ke3":1403," 80.":1404,"Rhg1":1405," Nxb6":1406," Rbc8":1407,"bxa6":1408," Kh5":1409," Rhd8":1410,"Kxd8":1411," gxf3":1412,"Rxg4":1413," Kd3":1414,"Qxc2":1415,"gxh6":1416," Rxg5":1417," Bxa2":1418,"Rhf1":1419,"62.":1420," Bxh6":1421," Rec8":1422,"Bg7":1423,"Nxe2":1424," Rxf7":1425,"Qxb3":1426," Nxc2":1427,"Nxe3":1428," Nxe7":1429,"Kxf6":1430," Kg3":1431," Rxb1":1432," Qh2":1433," exf6":1434," Qxa5":1435,"Kxf4":1436,"Bxa5":1437,"Rxb3":1438," Kc3":1439,"Rxb1":1440,"Qxb2":1441,"Nxa4":1442,"Ka4":1443," Qg1":1444,"Kxe3":1445,"Rxa3":1446," h2":1447,"Be8":1448,"Rbc1":1449,"63.":1450,"Qxc8":1451," Qxc7":1452," Nxh5":1453,"Rbd1":1454,"Qxd1":1455," Rbd8":1456," 81.":1457,"cxb3":1458," bxa3":1459,"Nxd8":1460,"Nfd2":1461,"Qxa4":1462,"Ka6":1463," dxe3":1464," Rxb8":1465,"Kxg3":1466,"bxa3":1467,"Nde2":1468,"Nxf8":1469,"Rec1":1470,"Kxd1":1471,"Ka7":1472," Nh":1473," f2":1474," Rxa7":1475,"xf7":1476," Rhg8":1477,"Ka5":1478,"Kxh7":1479,"xg7":1480,"Bd8":1481,"gxh3":1482," cxd3":1483,"Kxg4":1484,"Qxf8":1485,"Rdc1":1486," gxh6":1487," exd6":1488," Rxf8":1489,"64.":1490,"Nxd3":1491," Bxh2":1492," Kxf8":1493,"Kxe4":1494,"Bxa8":1495,"Nxh5":1496," Rxh5":1497,"Qg1":1498,"Rxh4":1499," exd3":1500,"Nxe8":1501," Rdc8":1502,"Kxf5":1503,"Kxf8":1504," Kxe7":1505," Qg2":1506," Be1":1507,"Kxg5":1508," 82.":1509,"Bc8":1510," Qh7":1511," Bc1":1512,"Bxe8":1513,"Bxe2":1514," Bxc1":1515," Nce7":1516,"Qxe1":1517,"Qxc1":1518," Qxh2":1519,"Nxa7":1520,"65.":1521," Nh3":1522," Qg8":1523,"Nxb3":1524,"Ba1":1525," Kb3":1526,"Nxh6":1527," Rhf8":1528," N8":1529,"Kxh2":1530,"Kxg6":1531," bxa6":1532," Na":1533," Bh8":1534," 83.":1535," N7":1536,"Nb7":1537,"Rdg1":1538," Bd1":1539," Nbd5":1540," Bxa6":1541," g2":1542,"66.":1543," Bxd1":1544," Nxg2":1545,"Nxh4":1546," Qxc8":1547,"Nxh7":1548,"Rdf1":1549,"Rxa2":1550,"Kxd3":1551," Nxa6":1552,"Qxf2":1553,"Kxe5":1554," Nb2":1555," Bf1":1556,"Ka8":1557," Rce8":1558," Kxf6":1559," Nxa2":1560,"Rce1":1561," fxe3":1562,"Rxg8":1563,"Kxd7":1564,"exf7":1565," 84.":1566,"Nxa6":1567,"Nbc3":1568,"Bxd1":1569,"Qxh4":1570,"67.":1571," Nxh4":1572," Nxa5":1573,"Kxh5":1574,"Nxa8":1575,"Rxh8":1576,"Bh7":1577,"Ne8":1578,"Nh":1579," Bg2":1580,"Kxe7":1581," Bxa1":1582,"Kxd4":1583," Ka7":1584," Kh4":1585," Bg8":1586,"Bxa4":1587,"68.":1588," Nxh3":1589," 85.":1590," Qxe1":1591,"R5":1592,"Kxh4":1593,"Qxa8":1594,"Na":1595,"Kxe6":1596," N6":1597," gxh3":1598," Rbe8":1599,"Rbe1":1600,"Rxg3":1601,"N2":1602,"Bxc1":1603," Nxc1":1604," Kxd7":1605," Nxf1":1606,"Qxg3":1607," Rdf8":1608," Bb1":1609,"Kxh6":1610,"Kxh3":1611," Kxe6":1612," Qxh5":1613," Na3":1614," Rhc8":1615," Rdg8":1616," Qxa8":1617,"fxg7":1618," Nxa3":1619,"Bg8":1620,"Ba7":1621,"R3":1622,"69.":1623," 86.":1624,"Kxc4":1625,"R4":1626,"Kxd5":1627," cxb6":1628,"Nd8":1629,"Bb8":1630,"xg2":1631,"Rdd1":1632,"Bxb8":1633," Nxd1":1634," Qxc1":1635," Rxh1":1636,"Nbd4":1637," Bg1":1638,"R6":1639,"Kxc3":1640," Rxh6":1641,"Kxe1":1642,"Nxg3":1643,"Nxd1":1644,"Rxg2":1645," Nxg6":1646,"Qxf1":1647,"Nf8":1648,"Kxc2":1649," Rxg6":1650," R4":1651," Bxe7":1652,"Qxg2":1653,"70.":1654," Qh8":1655," 87.":1656,"Rxh3":1657," Ka8":1658," Rxg7":1659,"Bxb3":1660,"Nc8":1661,"Bxh3":1662,"Na6":1663," Rxg1":1664,"Ree1":1665,"Qxa1":1666,"Kxc5":1667," Kxe5":1668,"Ng7":1669,"Bxh4":1670," Bxa5":1671," Nec6":1672," Qxd8":1673," Kxd6":1674," Rcc8":1675," Bxe1":1676," Ka6":1677,"71.":1678," Bh2":1679,"exf3":1680," Nfd5":1681," Ned7":1682," Na8":1683," 88.":1684,"Nce4":1685," Qxf7":1686," Nde5":1687,"Rhc1":1688,"Kxb2":1689," Nhf6":1690," Ne1":1691,"Kxb4":1692,"xf2":1693," R5":1694,"Qxb8":1695," Qxa1":1696," Nge5":1697," Ree8":1698," Qxa6":1699,"Nge4":1700," Qxg6":1701," Rdd8":1702,"N3":1703,"Bxc2":1704," a1":1705," Bxb1":1706,"Bh1":1707,"Qh1":1708,"R7":1709,"Kxd6":1710," Nxe1":1711,"Rfa1":1712," Nxh2":1713," R6":1714," Kf2":1715," Kxf5":1716," Ka5":1717,"72.":1718,"Bxf1":1719,"dxc3":1720," Bxb6":1721," Nd1":1722,"Na7":1723," Qxf1":1724," 89.":1725,"Kxb5":1726," Reb8":1727," Kxg6":1728," Bxh5":1729," Kc2":1730," Rag8":1731,"R8":1732," N8d7":1733," Kxd5":1734," Nc1":1735," Kxd8":1736," Ke2":1737," Kxg5":1738," Bxc8":1739,"Nfd4":1740," Kg2":1741,"73.":1742," b1":1743,"Reb1":1744," Kh3":1745," N5":1746,"Nde4":1747," Rfa8":1748,"Bxg3":1749," Ba2":1750," 90.":1751,"Nxg2":1752," Kd2":1753,"Nbd7":1754," Kxh7":1755," Nxg7":1756," Nxa1":1757," Nxc7":1758," Qxe8":1759,"Nh7":1760," Bxb7":1761," Raa8":1762,"Nxa3":1763," Qxg7":1764," R2":1765,"Kxg1":1766," Kb2":1767," R3":1768,"Bxe1":1769," c1":1770,"Rxh1":1771," Ncd7":1772,"Rcc1":1773,"N5":1774,"gxf7":1775,"Nec3":1776,"Bxb2":1777," Kxf4":1778," Rxh7":1779,"74.":1780," cxb2":1781,"Rag1":1782,"Kxc6":1783," Kxh6":1784," Nce5":1785,"Kxa5":1786,"Nxe1":1787," Rxh8":1788," 91.":1789,"Ref1":1790,"R1d2":1791," Ndxe5":1792,"Kxe8":1793," Ka4":1794,"Red2":1795,"Qxa3":1796," Ngxe5":1797," N7f6":1798,"Qxh8":1799,"Bxa3":1800," Bxc7":1801,"Nbxd4":1802," Ng2":1803," Rff8":1804," d1":1805," Nxb7":1806,"Nxc2":1807,"75.":1808,"Nbxd2":1809,"Raa1":1810,"Kxb7":1811," Nef6":1812," Qxh6":1813,"Kxg8":1814,"Nfe5":1815,"Nxc1":1816,"dxe7":1817," Qxf8":1818," Nxh6":1819,"Qxh3":1820," Bxd8":1821," Kxh4":1822,"Rff1":1823,"Kxb3":1824," Bxa8":1825," 92.":1826,"Nxb2":1827," Ref8":1828," fxg2":1829," Qxb1":1830," Nf1":1831," N6d7":1832," Nh8":1833,"Kxc7":1834,"Rxg1":1835,"Ncd5":1836,"Nh1":1837," Rbb8":1838," Nce4":1839," exf2":1840," Nfe4":1841,"Kxb6":1842,"Nxb8":1843,"76.":1844," Na2":1845,"Rxh2":1846," Kxc6":1847,"Nce3":1848," Kxe8":1849," Kxc5":1850,"N1c3":1851," h1":1852," Rcb8":1853," e1":1854," Qxb8":1855," Bxg6":1856," Kxg4":1857," 93.":1858,"Qxb1":1859," R1":1860,"Kxa4":1861," Nbxd5":1862,"Ned4":1863,"Neg5":1864,"Rdh1":1865,"hxg7":1866," Kxc7":1867," Kxh5":1868,"cxb7":1869,"Bxh8":1870," f1":1871," Rcf8":1872," Ka3":1873,"Bxf2":1874,"77.":1875," Bxf8":1876," Nfxd5":1877,"Rde2":1878," 94.":1879,"N4":1880,"Nxh8":1881,"Bxa1":1882," Kxe4":1883," Kxc4":1884,"Na1":1885,"Rcd2":1886," Qxa7":1887," Rdb8":1888," Bxg7":1889,"78.":1890," Rxg8":1891,"Kxa6":1892," Ndc5":1893,"Rdb1":1894,"Qxg8":1895," g1":1896,"Rbb1":1897,"Rcf1":1898,"Nb8":1899," 95.":1900,"gxh7":1901,"Nxh3":1902,"Ng8":1903,"exd3":1904,"Rdd7":1905," Nxd8":1906,"10":1907,"Ndxe4":1908," Ncxe5":1909," Raxc8":1910," Kxb5":1911,"Kxc1":1912,"exd7":1913,"N2f3":1914,"dxc7":1915,"Nce5":1916," Rbf8":1917,"Rea1":1918," Kxd4":1919,"79.":1920,"Rcb1":1921,"Nxf2":1922,"Rdd2":1923,"Qxa2":1924," Red7":1925," Kxa4":1926,"R1e2":1927," Kxb4":1928," 96.":1929,"Bxg8":1930," N4":1931,"Rbf1":1932," axb2":1933," Rcd7":1934,"Nxf1":1935," Rfxd8":1936,"R2":1937,"Rdc2":1938,"Ree2":1939,"Raxd1":1940," Nh2":1941," hxg2":1942," Kxg3":1943," Rhb8":1944,"Kxa3":1945,"Kxh1":1946,"80.":1947," Kxh3":1948,"Rhb1":1949," R8d7":1950," Neg4":1951,"N1h2":1952,"Rcc7":1953,"N1d2":1954," 97.":1955,"Nfg5":1956,"Nhf3":1957," Ree7":1958," dxe6":1959," Qxh1":1960,"Rfe2":1961,"fxe7":1962," Kxb7":1963,"Ned2":1964,"Rfd2":1965," Raxd8":1966," Rde7":1967," Nxc8":1968,"Bxg2":1969," 98.":1970," Rdd7":1971," Kxf3":1972," Rdd2":1973," Nxf7":1974," Bxf7":1975," N7b6":1976," Kxb6":1977,"Kxa2":1978," Rdc7":1979," Ned5":1980," Rcc7":1981," Rfe7":1982,"81.":1983," Bxe8":1984," Nxb1":1985," Kh2":1986," Rea8":1987,"Rge1":1988," Nb1":1989,"Rfxd1":1990,"Raxc1":1991,"Ree7":1992,"Nfxd4":1993,"Ncb5":1994," Nde7":1995," Rgf8":1996," Bxh1":1997," 99.":1998,"Ndc4":1999," Nxf8":2000," Rcc2":2001," Nxe8":2002," Rdh8":2003," Rge8":2004,"Ned5":2005," Nfg4":2006,"axb7":2007," R8c7":2008,"Kxa7":2009," R7":2010,"Red3":2011," gxf2":2012,"Ncxe4":2013,"Rgf1":2014," N5f6":2015,"R1c2":2016," Qxg1":2017,"Rcc2":2018,"82.":2019," Kxb3":2020," Kxa5":2021," Rff7":2022," Kxh8":2023,"Ncd2":2024," 100.":2025,"Rah1":2026," Kxa3":2027," Nfxe4":2028,"Rff2":2029," Kxg8":2030,"Nexd4":2031,"Nxg8":2032," R8e7":2033,"Nef3":2034,"N1e2":2035," Rah8":2036," Ndb4":2037," gxh2":2038," Nfe8":2039,"83.":2040," Bxg1":2041,"Nxb1":2042," Nxh1":2043,"Nxa2":2044," Ree2":2045," Nac5":2046," Ncd4":2047,"Rgd1":2048,"Ree3":2049," Rgd8":2050," Kxc3":2051," 101.":2052," Ka2":2053," dxc2":2054,"Rec2":2055,"Bxb1":2056," Nhf4":2057,"R3d2":2058,"R1f2":2059," bxc2":2060,"Ref2":2061,"cxd7":2062,"Ngxe4":2063,"84.":2064,"Nbxd7":2065," Kxc8":2066," Rce7":2067,"Nhf5":2068,"Rhh1":2069," Ndc6":2070,"Rdd3":2071,"Nfd7":2072," Rhh8":2073," Nxa7":2074,"Kxh8":2075,"Kxc8":2076," Rec7":2077," Nfe7":2078," Nac7":2079,"Bxa2":2080," Ndf8":2081," Ncxe4":2082," Bxa7":2083,"Rda1":2084," dxe2":2085,"N5c3":2086," 102.":2087," Ba1":2088," Ref7":2089,"Rce2":2090," Rca8":2091," cxd2":2092,"Nfd5":2093," Nxb8":2094,"85.":2095,"Rdf2":2096,"xf8":2097,"Qxh2":2098," Rcg8":2099," Nac4":2100," Rfd7":2101," bxa2":2102," Rfg8":2103," Kxa6":2104," 103.":2105," Nexd5":2106," Rgg8":2107,"Rfe3":2108," Nbc4":2109," Ng1":2110," R8f7":2111,"Rde3":2112," Nef5":2113,"Rbb7":2114,"Bxh1":2115,"86.":2116," Nac6":2117,"Nxh2":2118," Nxh7":2119,"bxc7":2120,"Ba8":2121,"Nfe2":2122," Rba8":2123,"Ndxb5":2124," 104.":2125," Kxa2":2126," Kxh2":2127,"87.":2128,"N2b3":2129," Kf1":2130,"Rcg1":2131,"xf1":2132,"R1d3":2133," Nxa8":2134," Kg1":2135,"Rfg1":2136," Bh1":2137," Rbb7":2138,"Rca1":2139," Ncb4":2140," Rbc7":2141,"Rfd3":2142,"R3e2":2143," Bxh8":2144," Nce8":2145,"Rcd3":2146," Ke1":2147,"Nac3":2148," Rda8":2149," Rab7":2150,"Qxh1":2151," Rgc8":2152,"N1f3":2153,"N3d2":2154,"Raa7":2155," N5b6":2156," Kxe3":2157," 105.":2158," Rbb2":2159," Nce6":2160," N8e7":2161," Ncd5":2162,"Rgg1":2163,"Ndf1":2164,"88.":2165," Rac7":2166,"Nef4":2167," Kc1":2168,"Rff3":2169," Kb1":2170,"Nfxe5":2171," Kxg2":2172," Ncxd4":2173,"Rba1":2174,"Ndc3":2175," Reg8":2176,"bxa7":2177,"N2c3":2178,"Reg1":2179," Raa7":2180," fxe2":2181," Qxh7":2182," Kxb2":2183,"Bh8":2184,"89.":2185," Raa2":2186,"Kxb1":2187," Kxa7":2188," Kd1":2189," exd2":2190," 106.":2191,"Rfc2":2192," Rdf7":2193,"R4d2":2194," Qxh8":2195," Nxg1":2196," Nec5":2197," Kxf2":2198,"Nxa1":2199,"N4f3":2200,"Rff7":2201," Nfd4":2202,"Qxg1":2203," Rbg8":2204,"Ncxd5":2205," 107.":2206," Nfe6":2207,"Ncxe5":2208,"R1e3":2209," Rfc7":2210," Rbd7":2211," Ned4":2212," Rfxc8":2213,"Rbc2":2214," Bxb8":2215," Rae7":2216," Rcb7":2217,"N2g3":2218,"Nac5":2219," Ndb6":2220,"Nac4":2221,"Nde5":2222,"Ncd4":2223,"Ngf5":2224," N8h7":2225,"Nfe3":2226,"Rbb2":2227," Ndb8":2228," R6d7":2229,"Rgf3":2230," R6e7":2231," 108.":2232," N7c6":2233,"Nde3":2234,"90.":2235," Ree6":2236," Rfe6":2237," Ncb6":2238,"Rbg1":2239,"Rbd2":2240,"Kxb8":2241,"R3f2":2242,"Nec4":2243," Red6":2244,"N7":2245," R8b7":2246,"Nbc5":2247," Nfxd4":2248," Rff2":2249,"91.":2250,"Rgc1":2251,"Ref3":2252,"Rab2":2253," Rad7":2254," 109.":2255,"Ndf5":2256,"Rac2":2257," Kxd3":2258,"Rcc3":2259," Nba6":2260," Nhf8":2261,"N3h2":2262," Rha8":2263,"Rha1":2264,"R1b2":2265," Kh1":2266," Rdd6":2267,"Rfxf7":2268," Raf7":2269,"Rdc3":2270,"Rcb2":2271," Ngf4":2272,"N5f3":2273,"Ned3":2274," Neg8":2275,"92.":2276," Ndxc5":2277,"Rdf3":2278,"Nef5":2279,"Rce3":2280,"Raa2":2281,"R3c2":2282," Neg6":2283," Rcf7":2284,"Rae2":2285,"Ncd1":2286," 110.":2287,"dxe3":2288,"R6d2":2289," Ncxd5":2290,"Ngxe2":2291,"R1a2":2292," Rcd6":2293," Nec7":2294,"Nfd3":2295," R6f7":2296,"Na8":2297,"Rhf3":2298,"Rec3":2299," Ka1":2300,"Ncd3":2301," R6c7":2302," Ncd3":2303,"Rad2":2304," Ned6":2305,"Nhf1":2306,"Nac2":2307,"R4d3":2308,"Rbc3":2309,"Rge3":2310,"Rcf2":2311,"Rgh1":2312," 111.":2313,"Ncb4":2314," Ned3":2315,"Ndb1":2316,"93.":2317,"Rdd6":2318,"Nxg1":2319," Rch8":2320," Rgh8":2321,"N4b3":2322," Rff6":2323," Rgf7":2324," Nfg6":2325,"Bxh2":2326," Nde4":2327,"Nbd5":2328,"94.":2329," Rde6":2330,"R1c3":2331,"Rch1":2332," Nec4":2333,"R4e2":2334," Nbxd7":2335," N4d5":2336," Rdb7":2337," Bxh7":2338," R5d7":2339," Rbxc8":2340," R8c6":2341," Ncxe7":2342," 112.":2343," Rcc6":2344," Nge6":2345,"R5d2":2346," R8e6":2347," Rbc6":2348,"Nfe1":2349," Na1":2350,"exf8":2351,"Nfxd5":2352,"Neg3":2353," Rbe7":2354,"Reh1":2355,"Rhg3":2356," R8d6":2357,"Ndxc4":2358," Rfg7":2359,"Rdb2":2360," N7g6":2361," Ncb8":2362,"95.":2363,"Nge3":2364," Ndf4":2365,"Nh8":2366,"Ngf1":2367,"R4f2":2368," Kxc2":2369,"R1g2":2370," Nef4":2371," Rab6":2372,"Nce1":2373,"Ncxb5":2374,"Rgf2":2375,"R1d4":2376," Ngf8":2377,"Rdd8":2378,"Bxg1":2379,"Nfe4":2380," Ncd6":2381," R8a7":2382,"R1d6":2383,"R5e2":2384,"Ndb3":2385,"R5e3":2386,"Kxa1":2387," 113.":2388,"Rfg2":2389,"Rbd3":2390,"Rab3":2391," Nbd3":2392,"R1f3":2393," Nde6":2394,"Ndf4":2395," R4c7":2396,"R8d7":2397,"96.":2398," Rgg7":2399,"Raf2":2400,"Nab5":2401," Rgf6":2402," Rfxe8":2403," Rfxf2":2404,"Ned6":2405," Rba7":2406," N5c6":2407,"Rbe2":2408," N2":2409," Rfd6":2410," Rbf7":2411," Qxg8":2412," N6h7":2413," R5e7":2414," Rgb8":2415,"N3h4":2416,"Rhg2":2417,"Rfh1":2418,"N6":2419,"R5d3":2420," 114.":2421," Reh8":2422,"97.":2423,"Nec5":2424,"Ncb1":2425," Rca7":2426,"Rhd3":2427," Rexd8":2428,"Rgg2":2429,"Ncd6":2430,"R4e3":2431,"Rfxc1":2432,"Rfg3":2433,"Red4":2434,"Rgd3":2435," Reb7":2436,"Rhx":2437," R5f7":2438,"Rdd4":2439," R8g7":2440," N6h5":2441,"Ndc5":2442," Kxb8":2443," Raxb8":2444," 115.":2445,"Nbd6":2446,"Rgx":2447,"Rgg7":2448," R5c7":2449,"Reb2":2450,"Rbh1":2451,"Ncxd4":2452," N6d5":2453,"Rfxe1":2454,"Nhg4":2455," Ngxe7":2456," Rhg7":2457," Rfb7":2458," N3":2459,"Nge5":2460," Rbh8":2461," Rdd1":2462,"Rcc8":2463,"Rac3":2464," Nxg8":2465," N8c6":2466," Rdc6":2467," Rac6":2468," Rfh8":2469,"Rhg7":2470,"Nhf4":2471,"Rcc6":2472,"Kxa8":2473,"Rbb3":2474," R8f6":2475,"N3d4":2476,"R8e7":2477,"Rdh2":2478,"98.":2479,"Nxh1":2480,"Rhd2":2481,"Rhe3":2482,"xg8":2483," Ndf5":2484," Nh1":2485," Nab4":2486,"R5c2":2487," Nbc5":2488,"Rexd1":2489,"Rgb1":2490," R4c6":2491,"Nfg3":2492," Ref6":2493," 116.":2494,"R4f3":2495," Nab6":2496," Nfg8":2497,"Rba2":2498,"gxf8":2499,"Nfxd2":2500,"Rfb2":2501,"Ree8":2502,"N5d4":2503," Rcc1":2504,"N3e4":2505,"99.":2506,"dxe8":2507,"Ree4":2508,"Ncb3":2509," Nfe5":2510," Ree1":2511,"Ree6":2512," Nbc8":2513," Rcc4":2514," Nge4":2515,"N5e4":2516," Nec8":2517," Nhf5":2518,"Rdg2":2519," Nfd6":2520,"Nbd3":2521," 117.":2522," Rec6":2523,"Nab1":2524," Rce6":2525,"Rbf2":2526," Rcc3":2527,"Rca2":2528,"Rde4":2529," Rhg6":2530,"Raa8":2531,"Neg1":2532,"R6d3":2533," Rhx":2534,"N8":2535,"100.":2536," Rbb6":2537," Rbd6":2538,"Rhxf1":2539,"Nec1":2540,"Rcb3":2541," R5d6":2542," Rdd3":2543,"R1d5":2544,"R6d4":2545," Rdd5":2546,"R5c3":2547," Nab8":2548," Rge7":2549,"Nbc4":2550,"R1c6":2551," Rfg6":2552," Ndc4":2553,"Rbb8":2554," R8c3":2555," 118.":2556," Rcc5":2557," R8d3":2558,"Nab6":2559,"R7d6":2560," R4e7":2561," Rcb6":2562," Ndxf6":2563,"Nbc1":2564," Rgx":2565," R6b7":2566," Rhf6":2567,"Rfe4":2568," Rgg2":2569,"Nhg5":2570,"Nbc7":2571," Rhg2":2572,"R8f7":2573,"N4c3":2574," Kxa8":2575,"Ndf2":2576,"Nexg5":2577,"R4c2":2578,"Rge2":2579," Rge6":2580,"Reg2":2581,"Rbxc1":2582,"101.":2583," R8d4":2584,"R1e6":2585,"Rcd4":2586,"Nba3":2587," Nxh8":2588,"Nec2":2589," Raxe8":2590," Nfxg4":2591,"Rhh7":2592," R8d5":2593," Nbd4":2594,"Nfxg5":2595,"exd8":2596," R4c5":2597,"dxc8":2598,"Nbxd6":2599," Ree3":2600," Raa1":2601,"Rgh3":2602," R8c5":2603,"Rgd2":2604,"Nhf2":2605," R5e6":2606,"Rad3":2607,"Reg3":2608,"Rab7":2609,"Rhh2":2610,"Rgg3":2611,"Nfd1":2612,"Nac6":2613,"Rae3":2614,"Raa3":2615,"R8c7":2616," R5f6":2617,"R1h2":2618," 119.":2619," R4e6":2620,"N3e2":2621," Rba6":2622," Reg7":2623,"R6d5":2624," Nbd6":2625,"R1e4":2626," R1d2":2627," Rdf6":2628,"Rdd5":2629," Rhh7":2630," Nhf7":2631,"Rda2":2632,"Rea2":2633,"Rfd4":2634,"Rhf2":2635," R8c4":2636,"Rexe6":2637,"Rdxd3":2638," Rda7":2639," Rgh7":2640,"R3b2":2641,"Rcc5":2642," Ncd8":2643,"Rba3":2644," 120.":2645," Rea7":2646,"Ncxe2":2647,"R1b3":2648,"Nge7":2649," Rbb1":2650,"Ngxf7":2651," Ree5":2652," N4c6":2653," Rcd5":2654,"R1d7":2655,"R5d4":2656,"102.":2657,"Rcc4":2658,"Rdb3":2659,"Rbb6":2660,"R1c4":2661,"Raxe1":2662,"Nbc6":2663,"xh5":2664," Rab2":2665," R4d7":2666,"Rdxd5":2667,"R5f3":2668,"Rgf7":2669," Nexg4":2670,"R1a3":2671," R8b6":2672,"Nde6":2673,"Rbe3":2674,"R5f2":2675," R8a3":2676," N6e7":2677,"fxe8":2678,"Rexe7":2679,"Rfc3":2680,"Rdxd4":2681,"Ree5":2682,"R5e4":2683," R4f7":2684," Bxg8":2685,"Rgxg7":2686,"Rdc4":2687,"Rff4":2688," Rdxd7":2689,"R1a6":2690,"Rdxd7":2691,"Ndc6":2692," Rdxd6":2693,"Ncxd6":2694," Naxc5":2695," Kxe2":2696," N8c7":2697," Raa3":2698," R1e2":2699," exf1":2700,"Rbxb7":2701,"Rff6":2702," Red5":2703,"Nexd5":2704,"Neg4":2705,"Rgh2":2706," Rfe5":2707,"Ngxe6":2708," R5c6":2709," Nfd3":2710," 121.":2711,"Raa6":2712,"103.":2713,"Nec6":2714," R8e5":2715,"Ncb6":2716," R4f6":2717," Raa6":2718," Rbb3":2719," Rbxb2":2720," Nfh5":2721," N5g6":2722,"Nef6":2723,"Rbc7":2724,"104.":2725," Rcxd8":2726," Rhh2":2727,"Nfe6":2728,"cxd8":2729,"N1a2":2730,"Raxb1":2731,"Naxc5":2732," Rfa7":2733," Nge8":2734,"R1h7":2735," R8h7":2736," Rcxc2":2737,"N4g3":2738,"R2d3":2739," Rdg7":2740,"Rbd4":2741,"Rhf4":2742,"R1e5":2743,"Nge6":2744,"Rexe4":2745," R8e3":2746," Rac5":2747," Rbb4":2748,"Naxc4":2749," Nce3":2750," N4e5":2751," Nfxd7":2752," Rdd4":2753," R3d7":2754,"Rfh3":2755,"Rexe3":2756,"Rcf3":2757," N6e5":2758," 122.":2759," Nhg7":2760,"Nfxd7":2761,"R1c5":2762," R4b7":2763," Rgxg2":2764,"Ndxe6":2765," cxd1":2766," Nba4":2767,"R1e7":2768," Nhg4":2769,"xg1":2770,"Rfa2":2771,"Rgf4":2772,"R7c6":2773,"Raxa7":2774,"Rhh3":2775,"R4c3":2776," Nde3":2777," Rgf2":2778," R2d3":2779,"Rac4":2780,"Rbc4":2781,"105.":2782,"Ngf6":2783,"Rhe2":2784,"Nfd6":2785,"Nfxe6":2786," R8e4":2787," Rbc5":2788,"Rfe7":2789,"Red7":2790," Rhf7":2791," R8a6":2792,"N2c4":2793,"Ned7":2794," Nexc5":2795,"Nab3":2796,"Rca3":2797,"xh4":2798," Rde5":2799,"Rdxd6":2800,"Nfg1":2801," Rga8":2802," Rff5":2803," Ree4":2804,"Ref4":2805," 123.":2806," Rff3":2807," Naxc4":2808," Rac4":2809," Rfd5":2810," R1c2":2811," Rdxd5":2812,"106.":2813," dxe1":2814,"Rdg3":2815," Rgh6":2816,"Nac1":2817,"Rfxf6":2818,"R1f4":2819," R6a7":2820," Ndf7":2821," Rgd7":2822," R8d2":2823,"R7e6":2824," R8e2":2825," R2c3":2826,"Ngh2":2827," Raxa2":2828," R4d6":2829," Kxd2":2830,"R1c7":2831," Ngxf6":2832,"Red5":2833,"Rexe5":2834," Nge3":2835,"Rdxd2":2836," Nfe3":2837," R8c2":2838," Nac3":2839," Rff4":2840," Ngf5":2841," Rdc5":2842,"R3g2":2843,"Rdf4":2844," N6a5":2845,"Ngh5":2846," Rgg6":2847," 124.":2848,"Nce6":2849,"Ndf6":2850,"xh6":2851," Nfxe5":2852," Rad6":2853,"Ndxe2":2854," Rca6":2855,"R6e2":2856," R4e5":2857,"Nexf4":2858,"Rcxc3":2859,"Rcxc6":2860," Nef8":2861,"Ndxe5":2862," Rbxd8":2863," Nhg5":2864," R6g7":2865," Rexc8":2866,"Rfh2":2867,"Nef1":2868," Rhe6":2869,"R1g3":2870," Rexe7":2871," Rdb6":2872,"Rdc7":2873," Nhxf4":2874,"Rag7":2875,"R5c4":2876," Rbb5":2877,"Rga1":2878,"Rac5":2879," Nexf6":2880,"Rcxd1":2881," Rbd5":2882," 125.":2883," Rdxd4":2884,"Rcg2":2885," Ndxe7":2886," Rhxf8":2887," Nexd4":2888," Rcxc3":2889," gxf1":2890,"107.":2891,"R6e5":2892,"Rff8":2893," Kxf1":2894,"Rbg7":2895,"R4b2":2896,"N5a3":2897,"xh7":2898," Nca6":2899," Kxc1":2900," Rexe5":2901," Rcg7":2902,"Raf3":2903,"Nbxc5":2904,"Nfxe4":2905," bxc1":2906,"Rhd4":2907,"R1a5":2908,"Nhxf5":2909," Nbxc4":2910,"Rcxc7":2911," Rexe6":2912," Rcxc7":2913," Rgf5":2914,"N3a4":2915,"bxa8":2916,"Rec4":2917,"R5f4":2918," R5b7":2919," R3c7":2920," Rbe6":2921," R4d5":2922,"bxc8":2923," Rab5":2924,"Rcg7":2925," R4f5":2926,"Rac7":2927," Raa4":2928," Rce5":2929," Rag2":2930,"Nhf6":2931,"R3a2":2932,"Rexe2":2933," Ndc7":2934," 126.":2935,"Reb3":2936,"R6f4":2937," Kxd1":2938," Rae6":2939," Ref5":2940,"R8d6":2941," Nef3":2942," R8g6":2943,"Rhg4":2944," Rbxb7":2945,"R6f2":2946," R4b6":2947,"Naxb5":2948,"Ndxf3":2949," exd1":2950," Kxe1":2951," Nca4":2952,"Nhg3":2953,"Rbd7":2954," Nexc4":2955," Rfe2":2956," Rfh7":2957,"Rcd7":2958," Neg7":2959," N7xf6":2960,"Rff5":2961,"Ned1":2962,"hxg8":2963," bxa1":2964," Rbc2":2965," Ncb5":2966,"Rge4":2967,"Rhe4":2968,"R1b6":2969,"Ndc2":2970,"Rce4":2971,"R2e3":2972,"R7d5":2973,"Rexd4":2974," Red2":2975," Rhf5":2976,"Nce7":2977," Ngh7":2978," Rgc7":2979," R8b3":2980," Ndc3":2981,"Nab2":2982,"Rad4":2983," Rff1":2984,"Nfh5":2985,"Rab4":2986," Nfd8":2987," N7c5":2988,"xh3":2989," Rcxc4":2990,"Rbxb2":2991,"R6c2":2992,"Rbb4":2993,"Nexc4":2994," N7e6":2995,"R8g7":2996," Rdxc8":2997,"108.":2998," R8f5":2999," R8a4":3000,"R8b7":3001,"R1a7":3002," Rac2":3003," 127.":3004,"Ngxf3":3005,"R6e4":3006,"Reh2":3007,"Rdh3":3008,"R7e5":3009," R8h2":3010,"Rbf3":3011," R3c4":3012,"Ncxe6":3013,"R1xd4":3014,"R1h6":3015,"109.":3016,"Nde7":3017,"Rexd5":3018,"Ncd7":3019,"R7d2":3020,"Rcxc4":3021," Rcg2":3022," Rgd6":3023," Raa5":3024,"Rfd7":3025," Nhg6":3026," Kxb1":3027,"Ngf4":3028," Ngh6":3029," Rbg2":3030," Nexf5":3031,"Nde1":3032,"Rexd3":3033,"Rhh8":3034," Rcxc6":3035,"Rbb5":3036," N8a7":3037," dxc1":3038," Reg6":3039," Rhh1":3040,"cxb8":3041,"axb8":3042," Nec3":3043," R3d4":3044,"Rcxc5":3045,"Nhg2":3046," R2e3":3047,"110.":3048,"Qc":3049," Rexe2":3050,"Rfe5":3051," fxe1":3052,"Rde5":3053,"Nexd6":3054,"Nexf7":3055,"R1a4":3056," 128.":3057," Ngh5":3058,"Rcxc2":3059,"N1c2":3060,"R6e3":3061,"Rhxh7":3062," Rexe4":3063,"Ngxf5":3064," Nde8":3065," Nhg8":3066," R2e4":3067,"Nexf5":3068," R8a2":3069," R3d5":3070,"Raxa6":3071,"R1b7":3072,"R5b2":3073,"R4a3":3074,"R1h3":3075,"R4b3":3076,"Ngh3":3077,"Rec7":3078," Rcxc5":3079," R8a5":3080,"N7d5":3081," Rbd2":3082," Rcb5":3083,"Nfg4":3084,"Ngxe5":3085,"Rcd5":3086,"Nexd2":3087," Nhxf6":3088," R2d4":3089," Nac8":3090," Rbc4":3091," N8e6":3092,"Raa4":3093," Rec5":3094," Rfh6":3095,"R6f3":3096,"Rdg7":3097,"Rge7":3098,"R7d3":3099," Rab4":3100,"Rdxe4":3101," Rhd7":3102," Rhe7":3103," Rge5":3104,"Rad7":3105,"Nba5":3106,"Rgc2":3107,"Ndxf7":3108,"Rbd5":3109," R3e4":3110,"Nca4":3111," N8f6":3112," N7a6":3113," Rca5":3114,"Rgc3":3115,"Red6":3116,"R6c5":3117,"N1e3":3118,"N1d3":3119," Kxa1":3120," Rfxf3":3121,"Rbxd1":3122,"Rfxf5":3123," R2c4":3124,"R5b3":3125,"R4a2":3126,"R7f6":3127,"R8h7":3128," Rhg5":3129," Kxg1":3130," Rcd2":3131," Ncxb4":3132,"Qb":3133,"Rcb4":3134," Rcxd6":3135," Nbxd3":3136," Rdc4":3137," Ndxe4":3138," Rfc6":3139," Ncxd3":3140,"Rgh4":3141,"Reh3":3142,"Rgxg6":3143," 129.":3144,"Rfg4":3145,"Rexc1":3146," Rdh7":3147," N6xd5":3148," Rdc2":3149,"R7c2":3150," N4a5":3151,"Qa":3152,"111.":3153,"Qd":3154,"R1f6":3155,"R1xd5":3156," R5a7":3157,"fxg8":3158," Kxh1":3159," Rexd6":3160,"Rca4":3161," R5b6":3162,"R2c3":3163," R8h3":3164," N4xd5":3165,"Rfh4":3166," Rca4":3167," N8g6":3168," Rcd4":3169," R2a3":3170," Rad5":3171,"R5g3":3172,"Raxc8":3173,"Rhf5":3174,"Rgg6":3175,"Rfxf2":3176,"R8a7":3177,"Ndc7":3178," Ngxe4":3179," Ngxf2":3180,"Rea3":3181," 130.":3182,"R6c4":3183,"R7c5":3184," Rcxd5":3185,"Rdxe5":3186,"Rhg5":3187," Rexe3":3188," Rba5":3189," Qc":3190,"R1f7":3191," R5a6":3192," R3e7":3193," Qd":3194,"Rhd7":3195,"R1b4":3196,"R7b6":3197," Rhh6":3198," Ndxb4":3199," R8b4":3200," Rge2":3201," R3c5":3202,"Rab5":3203,"Rfb3":3204,"Rfxf3":3205,"N2e4":3206," axb1":3207," Rad2":3208," Rfd2":3209,"Rdb4":3210,"Rdc5":3211,"Rda3":3212," Nab7":3213,"R7e2":3214," R7d6":3215," Rhg4":3216,"Ndb4":3217," Nab3":3218,"Rac6":3219,"Rcd6":3220,"Rba4":3221," R8b2":3222,"Rab6":3223,"Raa5":3224," Raxa4":3225,"Rdc6":3226,"Rhe7":3227," Rdb5":3228,"Rgg8":3229,"Ndxc5":3230," Nfg5":3231," Rhf4":3232,"R7a6":3233," Ndf3":3234,"N1f2":3235," R3f7":3236,"Ngxe7":3237," Reh7":3238," R1a2":3239,"R5a2":3240,"Rhg6":3241,"Ndxf5":3242,"Raf7":3243," Rfxf4":3244," Rbxb3":3245," Qe":3246,"Rhc3":3247,"Rge5":3248,"Rde7":3249,"R6f5":3250," Rcxd4":3251,"gxh8":3252," Neg5":3253,"112.":3254,"Rca5":3255," R8b5":3256," 131.":3257,"Ngf7":3258,"Rdf7":3259,"Rgd4":3260,"R5a4":3261,"Rhf7":3262," Rgg3":3263,"R7e3":3264,"Qe":3265,"Rcxd5":3266,"Raxa5":3267,"Rdxe3":3268," Rgg4":3269,"Rfxf4":3270," R2c7":3271," Red4":3272," R4b5":3273,"Rae7":3274," Rce4":3275,"Rcxd4":3276," Nbc7":3277," R1h2":3278," 132.":3279,"Rhh6":3280,"R7d4":3281," R1b2":3282,"R4g3":3283," R3e5":3284," R1f2":3285,"Rfxe3":3286," Rdf5":3287," Rbd4":3288," R3f5":3289," R2b3":3290,"Nfh4":3291," R3b7":3292," R7e6":3293," Rdxd3":3294," R4g6":3295,"113.":3296," Rfg5":3297," R3f4":3298," Nbxc6":3299,"Nexd7":3300," R3d6":3301,"Rdxf1":3302,"Nca3":3303," N7e5":3304," Rag7":3305,"Rbd6":3306," R8h6":3307," R1d3":3308," Rbxb4":3309," Rde4":3310,"Neg2":3311," Rhxh2":3312," Rec2":3313,"Rbc5":3314,"Rcf7":3315," R8f3":3316," Rgf4":3317,"114.":3318,"Qf":3319," cxb1":3320," Rfxe6":3321," R8f4":3322,"Nbxd5":3323,"Rhc2":3324,"Nfh2":3325,"R6c3":3326,"Rdxc1":3327,"N8c6":3328,"Rdxc3":3329,"Ndxf6":3330," R3f6":3331," Rfe4":3332,"N3c4":3333,"Rce5":3334," Rbf2":3335,"R1xe4":3336,"Nhg1":3337," Rcf6":3338,"R4g2":3339," Qb":3340,"R5b4":3341,"N1g3":3342,"R6b2":3343,"N3xd4":3344,"Ndb2":3345,"N3g4":3346," Rexd5":3347," Rac3":3348,"Rexd2":3349,"Rch2":3350,"Rbxb6":3351,"Rdxe6":3352," R3a4":3353," Rhe5":3354,"Rec5":3355,"Rbf7":3356," R2f3":3357,"xh2":3358,"Rfc7":3359," Rgg1":3360,"R5g2":3361,"Nab4":3362,"R6xd5":3363," N4h5":3364," Rec4":3365,"Rbxb5":3366,"Rgf5":3367,"Rad6":3368," Reb6":3369," Rdxd2":3370,"Rce7":3371,"Rcb7":3372,"Rgg4":3373," R5g7":3374," R7c6":3375,"Nexf6":3376," Rab3":3377,"Ndb6":3378," Rhd6":3379," Ncb3":3380,"R1xd2":3381," R8f2":3382," Rae2":3383," Rhd5":3384,"Rgd7":3385," R4g7":3386,"R7c3":3387," 133.":3388," Rcb4":3389,"R6b3":3390," Rbxb6":3391," Nhf3":3392," Rfxb8":3393,"Nbc2":3394," Qf":3395," Rdxe5":3396," Qa":3397," Rfxf7":3398,"Nfe7":3399," Rgh5":3400,"R8e6":3401," Rhe2":3402," Rbxb5":3403,"Nexc5":3404," Rgg5":3405,"R6a5":3406," N4a6":3407,"Qg":3408," 134.":3409,"Rfd5":3410," Rcxd7":3411," Raxa7":3412," Rgxg3":3413," Rfh5":3414,"Rdxc4":3415," Rdg2":3416," Rhh5":3417,"N2e3":3418," Ngf7":3419,"Rfg7":3420,"R5a3":3421,"Rde6":3422,"R1b5":3423,"R3h2":3424," R3c6":3425,"Nfxd6":3426," R2d7":3427,"Rad5":3428,"Rdxf7":3429," Rhh4":3430,"Raxa4":3431," Ngxf4":3432," R4a7":3433,"Qh":3434,"Rae4":3435,"R1f5":3436," N6xe5":3437," Nbxd4":3438," Rexd7":3439,"Rbe7":3440,"Rgg5":3441," R2c6":3442,"Rhh4":3443," N8d6":3444," Raxa3":3445,"Rfxe4":3446," Rce2":3447," R5g6":3448," Ncxe3":3449,"Rag2":3450," Raf2":3451," R3b4":3452," Nca5":3453," Ned8":3454,"R1h4":3455," N5e6":3456,"Ngf2":3457," Rbg7":3458,"Nexc3":3459,"Nbxc3":3460," Rhd2":3461,"R2d4":3462,"R7e4":3463," Rfxf5":3464," Nbc2":3465," Rhg3":3466," Rbe2":3467," Ndxf4":3468,"Nca5":3469," R2d6":3470," Nexf4":3471," Ngf3":3472,"Rhg8":3473," Rgd2":3474," N6c5":3475," R3b6":3476,"115.":3477," Rhh3":3478,"Nfg6":3479," Rgc2":3480," 135.":3481,"Rfe6":3482,"R1xd3":3483," N4xe5":3484," Nab5":3485,"Ngxf6":3486,"Ncxb4":3487," Nbc3":3488,"Ref5":3489," R8xd5":3490,"Rbc6":3491,"Nhxf6":3492,"Rfd6":3493," Ndxe3":3494,"Nhg6":3495,"116.":3496," Ndb5":3497,"Rgf6":3498,"Rbxb4":3499,"R2f3":3500,"Reg4":3501," Rcf2":3502," R8xd7":3503,"N3xe4":3504," Rde2":3505," Rcd3":3506,"Rcxd3":3507," Rcb2":3508,"Nef2":3509," Rfxf6":3510,"Ndxf4":3511,"Rbxb3":3512," R2e7":3513," hxg1":3514," Rfc2":3515,"Rdb7":3516," N8g7":3517," R4a5":3518," Raf6":3519," Ndb7":3520," R6h7":3521," Raxa5":3522,"Rhf6":3523,"Reg7":3524," N6g5":3525,"Rdxc5":3526," Rbf6":3527," Ndxc4":3528,"N3d5":3529,"Rdf6":3530,"117.":3531," Raxa6":3532," N8a6":3533,"Rhxh6":3534," R2d5":3535,"Rfxe2":3536,"Nbxc7":3537," R3e6":3538," Raxf8":3539,"Rdb6":3540," Rda6":3541,"R6b4":3542,"R7c4":3543," 136.":3544,"Ref7":3545,"R6b5":3546,"Nge1":3547," Ngh4":3548," Ref4":3549," Reg5":3550,"R1h5":3551," R8h4":3552," R4g5":3553," R7f6":3554," Nfh4":3555,"Rcb5":3556," Rcxe4":3557,"Raxa2":3558,"R5g4":3559,"Nac7":3560,"Rcxf7":3561," Rcxc8":3562," Rge4":3563," R2e6":3564,"Rgc7":3565,"119.":3566," Rda5":3567," Rhg1":3568," R4a6":3569," Nef7":3570,"Rdh4":3571,"R1xe5":3572," Nhg3":3573,"Rbg2":3574," R3b5":3575," Rfxe5":3576,"Rcxd2":3577,"Rhc7":3578," Nde2":3579," Naxc3":3580," R2e5":3581," Rfd4":3582,"Rda4":3583," Qh":3584,"Rcg3":3585," Nexc6":3586," Nexd3":3587," N8xd7":3588,"N5a4":3589," Rdb4":3590,"N4f5":3591,"R1xe6":3592," R1e3":3593," N4c5":3594,"Ndc1":3595," Red3":3596," Rhc7":3597," R8h5":3598," R8xc5":3599," Nfh7":3600,"R7f3":3601," Rdg6":3602,"Rbe4":3603,"R8c6":3604," R2b7":3605," R2b4":3606,"Rfb7":3607,"Nba4":3608,"Nexf3":3609,"R1xe2":3610,"R5xd4":3611," Rfxe7":3612," Nba5":3613," Rbc3":3614,"Ncxd7":3615," R8xd6":3616," Rdxe6":3617,"N1g2":3618,"R8d5":3619," N2d4":3620," N1":3621,"Rdxe2":3622," Ndxf2":3623,"N2xf3":3624,"N5c4":3625," Rae5":3626,"R7b3":3627,"Rcxd6":3628,"Rdxc6":3629,"Nfh3":3630,"Rgb2":3631,"Q8":3632,"Rdxc2":3633,"Reb7":3634," Nfe2":3635,"118.":3636," 137.":3637," Qg":3638," Rea6":3639,"Rba5":3640,"Nexc6":3641," Rgd5":3642," N6c7":3643,"Ngh4":3644," Rdf4":3645," R8xd4":3646," N6f5":3647," R2f4":3648," Nbd8":3649,"Rdb5":3650,"Ndf7":3651," Rch7":3652,"R1xc4":3653,"R8d4":3654,"R8d2":3655,"Rfa3":3656," Rdf2":3657,"Rcb6":3658," Ndc8":3659," Ned2":3660," Rgc6":3661," Rfb2":3662," Ngxe3":3663,"R4h2":3664,"R7g6":3665," Rfb6":3666," Ngf2":3667," Nexf2":3668,"R1xf2":3669," Rgb7":3670,"Rhh5":3671," Rba4":3672," R3a6":3673,"Raxf1":3674," Nexf3":3675,"N1a3":3676,"Raxa3":3677,"Nbd1":3678,"Rdf5":3679," Rexd4":3680,"R1xc2":3681," R3a7":3682," Rdc3":3683," Rgf3":3684," fxg1":3685,"Rhe5":3686,"R7f2":3687,"120.":3688," Rdxe4":3689," Reb2":3690," Rbd3":3691,"R1g4":3692,"R5h2":3693,"R8d3":3694," 138.":3695," Rfc5":3696," Rhf2":3697," Ncd2":3698,"Nef7":3699,"Nhxg6":3700," Nexd6":3701," R2g3":3702," Rbxc4":3703," R8xc6":3704,"R7h6":3705,"N8d7":3706," Rcf4":3707,"R1g7":3708,"R5h4":3709,"N3f4":3710,"Rhxh5":3711," Naxb3":3712," Rad4":3713," Rdxe7":3714,"R3d4":3715,"R6a4":3716,"Reh4":3717," Rbxc6":3718,"Ncxe7":3719,"Rfc4":3720," Nbxa4":3721," Rdxf8":3722,"N1xd2":3723,"R7f4":3724," Rfg2":3725,"Rexf7":3726," N4f6":3727," R7d5":3728," Rdxc5":3729,"Rec6":3730," Nfxe3":3731,"Ndxc6":3732,"Nec7":3733," N5f4":3734," Rhxh3":3735," Rfe3":3736,"Rexf5":3737,"Nhxf3":3738," Rdxc6":3739," R5h7":3740,"N5xe4":3741,"R2a3":3742,"Rda5":3743,"Rce6":3744,"R1xc3":3745,"Rgxg5":3746," R2c5":3747,"Raxf7":3748,"Rfxe5":3749,"Rdxe1":3750," R8g5":3751,"Raxb5":3752,"Rexf4":3753," Ncxe6":3754,"Rgf8":3755," R7b6":3756,"Rae5":3757," Rfxd6":3758,"Rdxf6":3759," Ndxf5":3760,"Naxc6":3761,"Rfxd2":3762,"R6a2":3763,"R7f5":3764,"R7b2":3765," R1c3":3766,"Rbxd5":3767,"R4h3":3768," R8xe5":3769,"Rfg5":3770,"Ref6":3771," Rdxc7":3772,"R7a5":3773," 139.":3774," Rfxd7":3775," Rde3":3776,"Rca6":3777,"R6h4":3778,"N5h4":3779,"R2d6":3780,"Rfxe6":3781,"Rexd6":3782," Ref2":3783,"Ndxe7":3784,"R2c4":3785," Nhxg4":3786," Rcb3":3787," R8g2":3788," Nhxf5":3789," R1g2":3790," Raxb4":3791," Rhc2":3792,"Rgh5":3793,"R6g5":3794," R4h7":3795," R2b6":3796," R1d5":3797,"Raxc6":3798," Red1":3799," R8xe7":3800,"R2e4":3801,"121.":3802,"Rfxd3":3803,"Ndxc3":3804," R3g4":3805," Rexf5":3806,"Rfh5":3807," Rfd3":3808," R2f6":3809," R2h3":3810," Raxc3":3811," Raxb2":3812,"Rexf3":3813," Nfg3":3814,"Rbxc3":3815," 140.":3816,"R1xc5":3817,"R1xe3":3818," N8f7":3819," R1d4":3820,"Rdg4":3821," Nexd7":3822," R8g3":3823,"N7e5":3824," Rad3":3825," Reh6":3826," Rhf3":3827,"Rgxf1":3828," Raxd7":3829," Rdxe8":3830," R5h6":3831," R2a4":3832,"Rhxe1":3833," Rdb2":3834," Rhe4":3835," R8xc7":3836,"Rge6":3837,"R2b3":3838,"Nhxg5":3839,"Rhxc8":3840," Rdxf2":3841,"Neg6":3842," R8xe4":3843," N8b6":3844,"Rad8":3845," Raxc5":3846,"Reg5":3847," Reg2":3848,"Nfxg6":3849,"R1xd6":3850,"123.":3851,"Rcxc1":3852," Rbe4":3853," Ndxc3":3854,"R6h5":3855,"Raxb4":3856,"Raxb7":3857," Rhb2":3858," Naxb4":3859,"Raxd6":3860,"N3a2":3861," R3a5":3862,"122.":3863,"Rexc3":3864,"Rbxf7":3865,"Rah2":3866," Rdxc4":3867,"Rbxc6":3868,"Rhb2":3869,"Rbxc4":3870,"Rgb3":3871," R7c5":3872,"Rfxd4":3873,"Rcf4":3874," Rce3":3875,"Rgb7":3876,"N2d4":3877,"Rea4":3878," Nfxe6":3879," Rbe5":3880,"Rbc8":3881,"R6g4":3882,"R6xd4":3883," R3g5":3884,"Red8":3885," R2a7":3886," Raxc4":3887," Rfg4":3888," Rcxe5":3889,"N2d3":3890,"R7b5":3891," Rca3":3892," Nexc3":3893,"R5xe4":3894," Raxb6":3895,"Nbxa5":3896," Rec3":3897," Rdf3":3898,"Nhxf7":3899," Rhxh4":3900," 141.":3901," Rac1":3902,"R1g6":3903,"N1b2":3904," N7xb6":3905," Rab1":3906," Raxb3":3907," Rgc5":3908," Rgf1":3909,"Nhf7":3910," R1e4":3911,"Naxb6":3912,"Rfg6":3913,"Ncxb6":3914,"Nhxf4":3915,"N7c6":3916," Raxb5":3917,"Rdxd1":3918,"Reg6":3919," Nfg7":3920," Nfh6":3921,"Rbxd6":3922,"N5xd4":3923," Rad1":3924," Rdxc3":3925,"Rcxe6":3926," Rbxd6":3927,"R8e5":3928," Nfxd3":3929,"Rcxe4":3930,"Rbe5":3931," Rgxg4":3932,"Rab8":3933," Rbxf2":3934,"R1xc6":3935," Rgh4":3936,"Rgxg4":3937," N3c5":3938," 142.":3939,"Rfe8":3940,"Rfxf8":3941," Rcd1":3942,"Ncxe3":3943," R1d7":3944,"N4b5":3945," Rae4":3946," Rfh4":3947," Rdxd8":3948,"Nexg6":3949," R8xc3":3950," R8xe6":3951,"Rhe6":3952,"Reb4":3953," Rexf4":3954," Rbxa4":3955," Ndb3":3956,"Rgd5":3957,"R7xe6":3958," N5xf6":3959," N2c4":3960,"124.":3961," Rbxc3":3962," Reg4":3963," Reh5":3964,"Rbf4":3965,"R6xe5":3966," R4h5":3967,"R7a2":3968,"N4e3":3969,"R2d5":3970," Rdb3":3971," Rhd4":3972," Nce2":3973," Rgb2":3974,"Naxc3":3975,"R6g2":3976," R2f5":3977,"Rac8":3978," Raxd6":3979," Rfc4":3980,"Rhe8":3981," Rexf6":3982,"R5h3":3983,"Raxc5":3984,"Rfxf1":3985," Rcf5":3986," Rcxb4":3987," Rbxe4":3988," R8xe3":3989," R1e5":3990,"R8f6":3991," R2f7":3992,"Rdxd8":3993," Rcxb5":3994," Rcxf2":3995," Rbxd4":3996,"Nfxe7":3997," 143.":3998,"Rfxb1":3999," Rfe1":4000," Rfxe4":4001,"Rhb7":4002," Rdxe3":4003," Ndxb6":4004," Rgxg5":4005,"R6a3":4006," N4g5":4007," Rfxd5":4008,"Rexf6":4009," Rexc7":4010," Rbxe8":4011,"R6g3":4012,"R6h2":4013,"R7xc6":4014,"R8e4":4015," Ncxb3":4016," 144.":4017," Ncxb5":4018," Q1":4019,"Rhb3":4020," Rdh6":4021,"Rcd8":4022,"Rcxb4":4023," Rcxe8":4024," Ncb7":4025," R3g7":4026,"R2c6":4027," R7d3":4028," Nhxg3":4029,"Rbxa5":4030," R3h4":4031,"N7b5":4032,"Raxb2":4033," Raxb7":4034,"Rexf2":4035," Ref3":4036,"Rch3":4037," Rcxb7":4038,"R1xf4":4039,"N2f4":4040," Rgxf8":4041," Rge3":4042,"Raxb3":4043," Raxc6":4044," Ndxf3":4045," Neg3":4046,"Raxd5":4047," Reb4":4048," Reb5":4049,"Rbxc5":4050," R7a6":4051," Rgxg7":4052," gxh1":4053,"Rcxe5":4054,"Rcxc8":4055," Ncxd7":4056," Ncxb6":4057,". ":4058,"R1xf5":4059," N4e6":4060," N3f4":4061," Rae1":4062," Rah7":4063,"Rdg6":4064,"Rhd5":4065," Rdg5":4066," Rhe1":4067,"R1g5":4068,"Rcxe3":4069," Rcxe7":4070," Rba3":4071,"Rbg3":4072,"Rbxa4":4073," R3g6":4074,"R2d7":4075," R7d4":4076,"Nhxg4":4077,"Raf4":4078,"Raxd4":4079,"Raxe6":4080," Raxd5":4081," Rag1":4082," Raxc7":4083,"Rfxd5":4084," Ngxf3":4085,"Rhxf7":4086,"Rexe8":4087,"Ndxc7":4088," Rbc1":4089,"R7b4":4090," R2g4":4091," R1a3":4092," N2e4":4093,"Rexe1":4094," Rdh5":4095}